#    -*- mode: org -*-


Archived entries from file /home/earl/Documents/quickcheck/quickcheck-tests.org


* CANCELLED seq-map-divide-by
:PROPERTIES:
:ARCHIVE_TIME: 2025-07-19 Sat 13:58
:ARCHIVE_FILE: ~/Documents/quickcheck/quickcheck-tests.org
:ARCHIVE_OLPATH: Utilities
:ARCHIVE_CATEGORY: quickcheck-tests
:ARCHIVE_TODO: CANCELLED
:END:
:LOGBOOK:
CLOCK: [2025-07-05 Sat 08:47]--[2025-07-05 Sat 08:48] =>  0:01
:END:


* CANCELLED Test divide-array-values-by-min-array-value
:PROPERTIES:
:ARCHIVE_TIME: 2025-07-19 Sat 13:58
:ARCHIVE_FILE: ~/Documents/quickcheck/quickcheck-tests.org
:ARCHIVE_OLPATH: Utilities
:ARCHIVE_CATEGORY: quickcheck-tests
:ARCHIVE_TODO: CANCELLED
:END:
:LOGBOOK:
CLOCK: [2025-07-04 Fri 05:58]--[2025-07-04 Fri 06:08] =>  0:10
CLOCK: [2025-07-04 Fri 04:33]--[2025-07-04 Fri 05:01] =>  0:28
CLOCK: [2025-07-04 Fri 04:21]--[2025-07-04 Fri 04:23] =>  0:02
:END:

// remove from archive
* CANCELLED partial-partial
:PROPERTIES:
:ARCHIVE_TIME: 2025-07-19 Sat 15:06
:ARCHIVE_FILE: ~/Documents/quickcheck/quickcheck-tests.org
:ARCHIVE_OLPATH: Utilities/dash/extensions
:ARCHIVE_CATEGORY: quickcheck-tests
:ARCHIVE_TODO: CANCELLED
:END:
:LOGBOOK:
CLOCK: [2025-07-19 Sat 14:47]--[2025-07-19 Sat 14:56] =>  0:09
CLOCK: [2025-07-19 Sat 14:26]--[2025-07-19 Sat 14:34] =>  0:08
:END:
from: between-one-and-?
#+begin_src elisp :tangle yes
  (ert-deftest-n-times partial-partial 100
    (-let (((expected-con (test-arg-one test-arg-two)) (generate-test-con-of-integers)))
      (should (equal (funcall (-compose (-rpartial funcall test-arg-two) (-rpartial funcall test-arg-one) (-partial-partial #'cons))) expected-con))))
#+end_src


* CANCELLED random-seq-value
CLOSED: [2025-07-22 Tue 22:20]
:PROPERTIES:
:ARCHIVE_TIME: 2025-07-24 Thu 00:27
:ARCHIVE_FILE: ~/Documents/quickcheck/quickcheck-tests.org
:ARCHIVE_OLPATH: quickcheck-tests/Utilities/seq/extensions
:ARCHIVE_CATEGORY: quickcheck-tests
:ARCHIVE_TODO: CANCELLED
:END:
:LOGBOOK:
CLOCK: [2025-07-22 Tue 22:19]--[2025-07-22 Tue 22:20] =>  0:01
CLOCK: [2025-07-05 Sat 06:37]--[2025-07-05 Sat 06:46] =>  0:09
CLOCK: [2025-07-05 Sat 05:02]--[2025-07-05 Sat 05:09] =>  0:07
:END:

